cf_billing/InformationRegisters/энргМаксимальныеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргМаксимальныеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргМаксимальныеПоказания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПолучениеДанных

// Заполняет максимальные показания срез последних.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура МаксимальныеПоказанияСрез(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаписиНабора());
	Пакет.ТаблицаДляПомещения 		= "НаборЗаписейМаксимальныеПоказания";
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, КлючПомещения, ПриборУчета, Шкала, ТарифнаяЗона";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"МаксимальныеПоказания",ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		Пакет.Операторы[0].Отбор.Добавить("МаксимальныеПоказания.Период <= &" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
			
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСрезПоследнихИзНабора());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ГИСЖКХ

// Заполняет схему объекты для передачи в ГИСЖКХ.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуОбъектыДляПередачиВГИСЖКХ(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт

	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъектыДляПередачиВГИСЖКХ());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорОтбора 				= Пакет.Операторы[0].Отбор;
	
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "КлючПомещения,ПриборУчета";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорОтбора, "ГИСЖКХИдентификаторыПодъездов", ПараметрыСхемы.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаписиНабора()
	Текст 							= 
	"ВЫБРАТЬ
	|	МаксимальныеПоказания.Организация КАК Организация,
	|	МаксимальныеПоказания.Район КАК Район,
	|	МаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	МаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказания.Шкала КАК Шкала,
	|	МаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныеПоказания.Период КАК Период,
	|	МаксимальныеПоказания.ДокРегистратор КАК Регистратор,
	|	МаксимальныеПоказания.Разделитель КАК Разделитель,
	|	МаксимальныеПоказания.Показание КАК Показание
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказания КАК МаксимальныеПоказания";
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаСрезПоследнихИзНабора()
	Текст 							=
	"ВЫБРАТЬ
	|	НаборЗаписейМаксимальныеПоказания.Организация КАК Организация,
	|	НаборЗаписейМаксимальныеПоказания.Район КАК Район,
	|	НаборЗаписейМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	НаборЗаписейМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	НаборЗаписейМаксимальныеПоказания.Шкала КАК Шкала,
	|	НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборЗаписейМаксимальныеПоказания.Период КАК Период,
	|	НаборЗаписейМаксимальныеПоказания.Регистратор КАК Регистратор,
	|	НаборЗаписейМаксимальныеПоказания.Разделитель КАК Разделитель,
	|	НаборЗаписейМаксимальныеПоказания.Показание КАК Показание
	|ИЗ
	|	(ВЫБРАТЬ
	|		МаксимумРегистратор.Организация КАК Организация,
	|		МаксимумРегистратор.Район КАК Район,
	|		МаксимумРегистратор.КлючПомещения КАК КлючПомещения,
	|		МаксимумРегистратор.ПриборУчета КАК ПриборУчета,
	|		МаксимумРегистратор.Шкала КАК Шкала,
	|		МаксимумРегистратор.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МаксимумРегистратор.Период КАК Период,
	|		МаксимумРегистратор.Регистратор КАК Регистратор,
	|		МАКСИМУМ(НаборЗаписейМаксимальныеПоказания.Разделитель) КАК Разделитель
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МаксимальнаяДатаРегистратора.Организация КАК Организация,
	|			МаксимальнаяДатаРегистратора.Район КАК Район,
	|			МаксимальнаяДатаРегистратора.КлючПомещения КАК КлючПомещения,
	|			МаксимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|			МаксимальнаяДатаРегистратора.Шкала КАК Шкала,
	|			МаксимальнаяДатаРегистратора.ТарифнаяЗона КАК ТарифнаяЗона,
	|			МаксимальнаяДатаРегистратора.Период КАК Период,
	|			МАКСИМУМ(НаборЗаписейМаксимальныеПоказания.Регистратор) КАК Регистратор
	|		ИЗ
	|			(ВЫБРАТЬ
	|				НаборЗаписейМаксимальныеПоказания.Организация КАК Организация,
	|				НаборЗаписейМаксимальныеПоказания.Район КАК Район,
	|				НаборЗаписейМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|				НаборЗаписейМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|				НаборЗаписейМаксимальныеПоказания.Шкала КАК Шкала,
	|				НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|				МАКСИМУМ(НаборЗаписейМаксимальныеПоказания.Период) КАК Период
	|			ИЗ
	|				НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|			
	|			СГРУППИРОВАТЬ ПО
	|				НаборЗаписейМаксимальныеПоказания.Организация,
	|				НаборЗаписейМаксимальныеПоказания.Район,
	|				НаборЗаписейМаксимальныеПоказания.КлючПомещения,
	|				НаборЗаписейМаксимальныеПоказания.ПриборУчета,
	|				НаборЗаписейМаксимальныеПоказания.Шкала,
	|				НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона) КАК МаксимальнаяДатаРегистратора
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|				ПО МаксимальнаяДатаРегистратора.Организация = НаборЗаписейМаксимальныеПоказания.Организация
	|					И МаксимальнаяДатаРегистратора.Район = НаборЗаписейМаксимальныеПоказания.Район
	|					И МаксимальнаяДатаРегистратора.КлючПомещения = НаборЗаписейМаксимальныеПоказания.КлючПомещения
	|					И МаксимальнаяДатаРегистратора.ПриборУчета = НаборЗаписейМаксимальныеПоказания.ПриборУчета
	|					И МаксимальнаяДатаРегистратора.Шкала = НаборЗаписейМаксимальныеПоказания.Шкала
	|					И МаксимальнаяДатаРегистратора.ТарифнаяЗона = НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона
	|					И МаксимальнаяДатаРегистратора.Период = НаборЗаписейМаксимальныеПоказания.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			МаксимальнаяДатаРегистратора.Организация,
	|			МаксимальнаяДатаРегистратора.Район,
	|			МаксимальнаяДатаРегистратора.КлючПомещения,
	|			МаксимальнаяДатаРегистратора.ПриборУчета,
	|			МаксимальнаяДатаРегистратора.Шкала,
	|			МаксимальнаяДатаРегистратора.ТарифнаяЗона,
	|			МаксимальнаяДатаРегистратора.Период) КАК МаксимумРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|			ПО МаксимумРегистратор.Организация = НаборЗаписейМаксимальныеПоказания.Организация
	|				И МаксимумРегистратор.Район = НаборЗаписейМаксимальныеПоказания.Район
	|				И МаксимумРегистратор.КлючПомещения = НаборЗаписейМаксимальныеПоказания.КлючПомещения
	|				И МаксимумРегистратор.ПриборУчета = НаборЗаписейМаксимальныеПоказания.ПриборУчета
	|				И МаксимумРегистратор.Шкала = НаборЗаписейМаксимальныеПоказания.Шкала
	|				И МаксимумРегистратор.ТарифнаяЗона = НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона
	|				И МаксимумРегистратор.Период = НаборЗаписейМаксимальныеПоказания.Период
	|				И МаксимумРегистратор.Регистратор = НаборЗаписейМаксимальныеПоказания.Регистратор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МаксимумРегистратор.Организация,
	|		МаксимумРегистратор.Район,
	|		МаксимумРегистратор.КлючПомещения,
	|		МаксимумРегистратор.ПриборУчета,
	|		МаксимумРегистратор.Шкала,
	|		МаксимумРегистратор.ТарифнаяЗона,
	|		МаксимумРегистратор.Период,
	|		МаксимумРегистратор.Регистратор) КАК МаксимумРазделить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|		ПО МаксимумРазделить.Организация = НаборЗаписейМаксимальныеПоказания.Организация
	|			И МаксимумРазделить.Район = НаборЗаписейМаксимальныеПоказания.Район
	|			И МаксимумРазделить.КлючПомещения = НаборЗаписейМаксимальныеПоказания.КлючПомещения
	|			И МаксимумРазделить.ПриборУчета = НаборЗаписейМаксимальныеПоказания.ПриборУчета
	|			И МаксимумРазделить.Шкала = НаборЗаписейМаксимальныеПоказания.Шкала
	|			И МаксимумРазделить.ТарифнаяЗона = НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона
	|			И МаксимумРазделить.Период = НаборЗаписейМаксимальныеПоказания.Период
	|			И МаксимумРазделить.Регистратор = НаборЗаписейМаксимальныеПоказания.Регистратор
	|			И МаксимумРазделить.Разделитель = НаборЗаписейМаксимальныеПоказания.Разделитель";
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаОбъектыДляПередачиВГИСЖКХ() 
	
	Текст  =
	"ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Период КАК Период,
	|	энргМаксимальныеПоказания.ДокРегистратор КАК Регистратор,
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Показание КАК Показание,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ЛОЖЬ КАК ИзменениеДатыПоверки
	//|	ВЫБОР
	//|		КОГДА энргМаксимальныеПоказания.Регистратор ССЫЛКА Документ.энргУстановитьДатуПоверкиПУ
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ИзменениеДатыПоверки
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО энргМаксимальныеПоказания.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|ГДЕ
	|	энргМаксимальныеПоказания.ДокРегистратор В(&мИзменения)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
